package com.example.ykcloud.emums;

import lombok.AllArgsConstructor;
import lombok.Getter;


@Getter
public enum ErrorCodeEnum {
    BASE99990100(100, "参数异常"),
    BASE99990401(401, "无访问权限，TOKEN为空"),
    BASE99990403(403, "禁止访问，TOKEN非法"),
    BASE99990404(404, "找不到指定资源"),
    BASE99990408(408, "TOKEN超时，请重新登录"),
    BASE99990500(500, "服务器内部异常"),
    BASE99990001(99990001, "注解使用错误"),
    BASE99990002(99990002, "微服务不在线,或者网络超时"),
    BASE99990003(99990003, "Http请求方法不支持或不存在"),
    BUSINESS10010001(10010001, "会话超时,请刷新页面重试"),
    BUSINESS10010002(10010002, "TOKEN解析失败"),
    BUSINESS10010003(10010003, "账号密码已被锁定，请联系管理员进行解锁"),
    BUSINESS10011001(10011001, "用户Id不能为空"),
    BUSINESS10011002(10011002, "找不到用户,loginName=%s"),
    BUSINESS10011003(10011003, "找不到用户,userId=%s"),
    BUSINESS10011004(10011004, "找不到用户,email=%s"),
    BUSINESS10011006(10012006, "手机号不能为空"),
    BUSINESS10011007(10011007, "登录名不能为空"),
    BUSINESS10011008(10011008, "新密码不能为空"),
    BUSINESS10011009(10011009, "确认密码不能为空"),
    BUSINESS10011010(10011010, "两次密码不一致"),
    BUSINESS10011011(10011011, "用户不存在, userId=%s"),
    BUSINESS10011012(10011012, "登录名已存在"),
    BUSINESS10011013(10011013, "手机号已存在"),
    BUSINESS10011014(10011014, "密码不能为空"),
    BUSINESS10011016(10011016, "用户名或密码错误"),
    BUSINESS10011017(10011017, "验证类型错误"),
    BUSINESS10011018(10011018, "邮箱不能为空"),
    BUSINESS10011019(10011019, "邮箱已存在"),
    BUSINESS10011020(10011020, "短信模板不能为空"),
    BUSINESS10011021(10011021, "发送短信验证码对象转换为json字符串失败"),
    BUSINESS10011022(10011022, "发送短信验证码失败"),
    BUSINESS10011023(10011023, "越权操作"),
    BUSINESS10011024(10011024, "找不到绑定的用户, userId=%s"),
    BUSINESS10011025(10011025, "用户已存在, loginName=%s"),
    BUSINESS10011026(10011026, "更新用户失败, userId=%s"),
    BUSINESS10011027(10011027, "找不到用户,mobile=%s"),
    BUSINESS10011028(10011028, "链接已失效"),
    BUSINESS10011029(10011029, "重置密码失败"),
    BUSINESS10011030(10011030, "激活失败, 链接已过期"),
    BUSINESS10011031(10011031, "验证码超时, 请重新发送验证码"),
    BUSINESS10011032(10011032, "邮箱不存在, loginName=%s,email=%s"),
    BUSINESS10011033(10011033, "清空该用户常用菜单失败"),
    BUSINESS10011034(10011034, "不允许操作admin用户"),
    BUSINESS10011035(10011035, "原始密码输入错误"),
    BUSINESS10011036(10011036, "新密码和原始密码不能相同"),
    BUSINESS10011037(10011037, "修改用户失败,userId=%s"),
    BUSINESS10011038(10011038, "激活用户失败,userId=%s"),
    BUSINESS10011039(10011039, "无访问权限，TOKEN为空"),
    BUSINESS10011040(10011040, "禁止访问，TOKEN非法"),
    BUSINESS10011041(10011041, "TOKEN已过期，请重新登录"),
    BUSINESS10011042(10011042, "Cookie转码异常"),
    BUSINESS10012001(10012001, "角色ID不能为空"),
    BUSINESS10012002(10012002, "拥有的角色不允许禁用"),
    BUSINESS10012003(10012003, "系统角色不能删除"),
    BUSINESS10012004(10012004, "超级角色Id不能为空"),
    BUSINESS10012005(10012005, "找不到角色信息,roleId=%s"),
    BUSINESS10012006(10012006, "删除角色失败, roleId=%s"),
    BUSINESS10012007(10012007, "批量删除角色失败, roleId=%s"),
    BUSINESS10012008(10012008, "找不到绑定的角色, roleId=%s"),
    BUSINESS10013001(10013001, "父菜单不存在"),
    BUSINESS10013002(10013002, "更新上级菜单失败,menuId=%s"),
    BUSINESS10013003(10013003, "菜单不存在,menuId=%s"),
    BUSINESS10013004(10013004, "启用菜单失败,menuId=%s"),
    BUSINESS10013005(10013005, "禁用菜单失败,menuId=%s"),
    BUSINESS10013006(10013006, "更新菜单状态失败,menuId=%s"),
    BUSINESS10013007(10013007, "根菜单不能禁用"),
    BUSINESS10013008(10013008, "删除菜单失败, menuId=%s"),
    BUSINESS10013009(10013009, "请先分配菜单"),
    BUSINESS10013010(10013010, "选择菜单不是根目录,menuId=%s"),
    BUSINESS10013011(10013011, "AD用户登录失败,loginName=%s"),
    BUSINESS10013012(10013012, "外部服务器连接异常，请联系管理员"),
    BUSINESS10013013(10013013, "密码错误，您还有%s次密码尝试，之后账号将被锁定"),
    BUSINESS10013014(10013014, "该用户已被禁用"),
    BUSINESS10013015(10013015, "当前用户无组织，请联系系统管理员"),
    BUSINESS10013016(10013016, "当前用户所在组织被禁用无法登录，请联系系统管理员"),
    BUSINESS10013017(10013017, "组织编码已重复"),
    BUSINESS10013018(10013018, "读取AD服务器失败"),
    BUSINESS10013019(10013019, "根据ID查询同级组织失败"),
    BUSINESS10013020(10013020, "同级组织名称不能重复"),
    BUSINESS10013021(10013021, "启用失败"),
    BUSINESS10013022(10013022, "禁用失败，%s有正常状态的子组织或员工关联该组织"),
    BUSINESS10013023(10013023, "角色编码已经存在"),
    BUSINESS10013024(10013024, "父级菜单不能是自己"),
    BUSINESS10013025(10013025, "操作代码%s已经存在"),
    BUSINESS10013026(10013026, "群组编码已存在"),
    BUSINESS10013027(10013027, "系统配置参数对应键值已存在，不能重复添加"),
    BUSINESS10013028(10013028, "系统配置参数格式错误，内容请填写JSON格式"),
    BUSINESS10013029(10013029, "获取实体表字段失败"),
    BUSINESS10013030(10013030, "创建文件目录已存在"),
    BUSINESS10013031(10013031, "连接失败，请检查服务端是否启动"),
    BUSINESS10013032(10013032, "断开连接失败"),
    BUSINESS10013033(10013033, "部署失败"),
    BUSINESS10013034(10013034, "获取系统参数失败，请检查键是否正确"),
    BUSINESS10013035(10013035, "jackrabbit列表获取失败，请检查系统配置是否正确"),
    BUSINESS10013036(10013036, "新分派的用户已经存在于当前任务的会签人员列表中，不能重复指派，请重新选择"),
    BUSINESS10013037(10013037, "该编码已存在"),
    BUSINESS10013038(10013038, "名称不能重复"),
    BUSINESS10013039(10013039, "只可以对今天及今天以后的日期执行委派"),
    BUSINESS10013040(10013040, "不可以循环委派"),
    BUSINESS10013041(10013041, "表单编码重复"),
    BUSINESS10013042(10013042, "请上传有效文件"),
    BUSINESS10013043(10013043, "工作流启动失败,请检查流程变量是否正确"),
    BUSINESS10013044(10013044, "任务执行失败,请检查流程变量是否正确"),
    BUSINESS10013045(10013045, "类型名称重复"),
    BUSINESS10013046(10013046, "对象不存在"),
    BUSINESS10013047(10013047, "类型id不能为空"),
    BUSINESS10013048(10013048, "更新的实体对象数量不能为空"),
    BUSINESS10013049(10013049, "类型内部名称不能为空"),
    BUSINESS10013050(10013050, "当前类型已有子类型，是否有子类型不能设置为否"),
    BUSINESS10013051(10013051, "当前类型为根类型，不可删除"),
    BUSINESS10013052(10013052, "当前类型存在子类型，不可删除"),
    BUSINESS10013053(10013053, "当前类型存在实例化对象，不可删除"),
    BUSINESS10013054(10013054, "软属性保存失败"),
    BUSINESS10013055(10013055, "内部名称已存在，请重新输入"),
    BUSINESS10013056(10013056, "类型名称不能为空"),
    BUSINESS10013057(10013057, "当前类型或父类型已存在扩展属性"),
    BUSINESS10013058(10013058, "当前类型或父类型已存在工作流"),
    BUSINESS10013059(10013059, "所选进程未关联生命周期"),
    BUSINESS10013060(10013060, "当前类型已有实例化，是否实例化不能设置为否"),
    BUSINESS10013061(10013061, "当前类型不能创建子类型"),
    BUSINESS10013062(10013062, "请选择父类型"),
    BUSINESS10013063(10013063, "根类型不可删除"),
    BUSINESS10013064(10013064, "导入失败，模板不正确"),
    BUSINESS10013065(10013065, "%s按钮编码已存在"),
    BUSINESS10013066(10013066, "上传失败，上传文件名包含特殊字符"),
    BUSINESS10013067(10013037, "该名称已存在"),
    BUSINESS10013068(10013038, "新密码不能与旧密码相同"),
    BUSINESS10013069(10013039, "文件大小超出上传限制, 请压缩或降低文件质量!");

    private String code;
    private String msg;

    private ErrorCodeEnum(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    private ErrorCodeEnum(Integer code, String msg) {
        this.code = code.toString();
        this.msg = msg;
    }

    public String msg() {
        return this.msg;
    }

    public String code() {
        return this.code;
    }

    public static ErrorCodeEnum getEnum(String code) {
        ErrorCodeEnum[] var1 = values();
        int var2 = var1.length;

        for(int var3 = 0; var3 < var2; ++var3) {
            ErrorCodeEnum ele = var1[var3];
            if (ele.code() == code) {
                return ele;
            }
        }

        return null;
    }
}
